'''
<< 결측치 처리 >>
1. 삭제 - 행  또는 열

2. 임의의 값
- 평균 : mean
- 중위 : median
- 0 : fillna
- 앞 값 : ffill
- 뒷 값 : bfill
- 특정값: 777 (뭔가 조건을 같이 넣는 것이 좋다.)
- 기타 등등

3. interpolate

4. 모델: .predict

5. 부스팅 계열 모델 : 통상 결측지, 이상치에 자유롭다.
'''

import pandas as pd
import numpy as np

dates = ['10/11/2024', '10/12/2024', '10/13/2024',
         '10/14/2024', '10/15/2024', '10/16/2024']

print(dates) # ['10/11/2024', '10/12/2024', '10/13/2024', '10/14/2024', '10/15/2024', '10/16/2024']

print("=======================================================")
ts = pd.Series([2, np.nan, np.nan, 8, 10, np.nan], index = dates)
print(ts)
# 10/11/2024     2.0
# 10/12/2024     NaN
# 10/13/2024     NaN
# 10/14/2024     8.0
# 10/15/2024    10.0
# 10/16/2024     NaN
# dtype: float64

print("=======================================================")

ts = ts.interpolate()
print(ts)
# 10/11/2024     2.0
# 10/12/2024     4.0
# 10/13/2024     6.0
# 10/14/2024     8.0
# 10/15/2024    10.0
# 10/16/2024    10.0
# dtype: float64